tests/status-service/load.yml
config:
  environments:
    dev:
      target: "https://status-service-core-services-dev.os99.gov.ab.ca"
    test:
      target: "https://status-service-core-services-test.os99.gov.ab.ca"
    uat:
      target: "https://status-service-uat.alpha.alberta.ca"
  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"
  payload:
    - path: "../artillery.{{ $environment }}.csv"
      skipHeader: true
      fields:
        - "keycloak_url"
        - "tenant_realm_id"
        - "client_id"
        - "client_secret"
        - "username"
        - "password"
  variables:
    tenant:
      - "demo"
      - "platform"
  phases:
    - name: warm up
      duration: 60
      arrivalCount: 50
    - name: load
      duration: 120
      arrivalCount: 500
before:
  flow:
    - log: "Getting the access token (tenant: {{ tenant_realm_id }}) for user {{ username }}"
    - post:
        url: "{{ keycloak_url }}/auth/realms/{{ tenant_realm_id }}/protocol/openid-connect/token"
        headers:
          Content-Type: "application/x-www-form-urlencoded"
          Accept: "application/json"
        form:
          {
            grant_type: "password",
            client_id: "{{ client_id }}",
            client_secret: "{{ client_secret }}",
            username: "{{ username }}",
            password: "{{ password }}",
          }
        capture:
          - json: "$.access_token"
            as: token
scenarios:
  - name: get application statuses
    flow:
      - get:
          url: "/public_status/v1/applications/{{ tenant }}"