tests/status-service/load.yml
config:
  environments:
    dev:
      target: 'https://status-service.adsp-dev.gov.ab.ca'
    uat:
      target: 'https://status.adsp-uat.alberta.ca'
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'
  payload:
    - path: '../artillery.{{ $environment }}.csv'
      skipHeader: true
      fields:
        - 'keycloak_url'
        - 'realm_id'
        - 'tenant_name'
        - 'client_id'
  phases:
    - name: warm up
      duration: 10
      arrivalRate: 10
    # - name: load
    #   duration: 120
    #   arrivalCount: 500 // creates users in 120 sec
    #   # arrivalRate: 10 // creates virtual users every second
    #   # rampTo: 50 // ramp to that users count in 120 duration sec
    #   # maxVusers: 50 // concurrent users
before:
  flow:
    - log: 'Getting the access token (tenant: {{ realm_id }}) for user'
    - post:
        url: '{{ keycloak_url }}/auth/realms/{{ realm_id }}/protocol/openid-connect/token'
        headers:
          Content-Type: 'application/x-www-form-urlencoded'
          Accept: 'application/json'
        form:
          {
            grant_type: 'client_credentials',
            client_id: '{{ client_id }}',
            client_secret: '{{ $processEnvironment.ARTILLERY_CLIENT_SECRET }}',
          }
        capture:
          - json: '$.access_token'
            as: token
scenarios:
  - name: get application statuses
    flow:
      - get:
          url: '/status/v1/applications'
          headers:
            authorization: 'Bearer {{ token }}'